app/views/contacts/_index.html.erb

  <tbody>
    <% @client.contacts.each do |contact| %>
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."client_id" = ?  [["client_id", 1]]