app/controllers/bills_controller.rb

INSERT INTO "bills" ("amount", "description", "person_id", "date", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bill = @client.bills.new(bill_params)

    respond_to do |format|
      if @bill.save

SELECT  "bills".* FROM "bills" WHERE "bills"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_bill
      @bill = Bill.find(params[:id])

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_client
      @client = Client.find(params[:client_id])