app/controllers/clients_controller.rb

SELECT "bills".* FROM "bills" WHERE "bills"."client_id" = ?  [["client_id", 2]]
---
  def show
    @edad = ((Date.current - @client.birthdate)/365).to_i
    @anios = Hash.new(0)
    @personas = Hash.new(0)
    @cant_bills_by_month = Hash.new(0)
    @client.bills.each do |bill|

INSERT INTO "clients" ("name", "surname", "gender", "cuit", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["surname", ""], ["gender", ""], ["cuit", ""], ["birthdate", "2015-12-15"], ["created_at", "2015-12-15 18:55:09.050480"], ["updated_at", "2015-12-15 18:55:09.050480"]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

UPDATE "clients" SET "name" = ?, "surname" = ?, "dni" = ?, "gender" = ?, "cuit" = ?, "birthdate" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["name", "Ramiro"], ["surname", "Antonio"], ["dni", 34234432], ["gender", "M"], ["cuit", "20-2341414-9"], ["birthdate", "2010-08-31"], ["updated_at", "2015-12-15 18:56:05.590297"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @client.update(client_params)

DELETE FROM "clients" WHERE "clients"."id" = ?  [["id", 1]]
---
  def destroy
    @client.destroy