app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("kind", "data", "client_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["kind", "Telefono"], ["data", "3434234"], ["client_id", 2], ["created_at", "2015-12-15 19:17:12.307115"], ["updated_at", "2015-12-15 19:17:12.307115"]]
---
  def create
    @contact = @client.contacts.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "data" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["data", "1542743333"], ["updated_at", "2016-02-04 21:55:59.032860"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_client
      @client = Client.find(params[:client_id])